e2e/load/results/t2-2core/k6-10vu.txt


  █ THRESHOLDS 

    http_req_duration{name:company_info}
    ✓ 'max>=0' max=676.72ms

    http_req_duration{name:dashboard}
    ✓ 'max>=0' max=1.1s

    http_req_duration{name:invoice_pdf}
    ✓ 'max>=0' max=2.86s

    http_req_duration{name:invoice_send}
    ✓ 'max>=0' max=1.44s

    http_req_duration{name:list_clients}
    ✓ 'max>=0' max=772.19ms

    http_req_duration{name:list_invoices}
    ✓ 'max>=0' max=470.32ms

    http_req_duration{name:list_quotes}
    ✓ 'max>=0' max=572.75ms

    http_req_duration{name:login}
    ✓ 'max>=0' max=0s

    http_req_duration{name:ocr_upload}
    ✓ 'max>=0' max=533.13ms

    http_req_duration{name:poll_invoice}
    ✓ 'max>=0' max=691.59ms

    http_req_duration{name:poll_ocr}
    ✓ 'max>=0' max=324.48ms

    http_req_duration{name:quote_convert}
    ✓ 'max>=0' max=895.74ms

    http_req_duration{name:quote_create}
    ✓ 'max>=0' max=1.05s

    http_req_duration{name:session}
    ✓ 'max>=0' max=509.76ms


  █ TOTAL RESULTS 

    checks_total.......: 5550    16.522548/s
    checks_succeeded...: 100.00% 5550 out of 5550
    checks_failed......: 0.00%   0 out of 5550

    ✓ session 200
    ✓ company_info 200
    ✓ dashboard 200
    ✓ list_quotes 200
    ✓ list_invoices 200
    ✓ list_clients 200
    ✓ quote_create 201
    ✓ quote_convert 201
    ✓ invoice_pdf 200
    ✓ pdf is a PDF
    ✓ invoice_send 201
    ✓ poll_invoice 200
    ✓ invoice sent
    ✓ ocr_upload 201
    ✓ poll_ocr 200
    ✓ ocr extracted

    CUSTOM
    ocr_to_extracted...............: avg=51.92s   med=58.31s   p(95)=59.99s   p(99)=1m3s     max=1m6s     count=47  
    send_to_sent...................: avg=1.48s    med=1.03s    p(95)=3.68s    p(99)=5.29s    max=7.79s    count=236 

    HTTP
    http_req_duration..............: avg=110.36ms med=43.34ms  p(95)=451.6ms  p(99)=1.02s    max=2.86s    count=5031
      { expected_response:true }...: avg=110.36ms med=43.34ms  p(95)=451.6ms  p(99)=1.02s    max=2.86s    count=5031
      { name:company_info }........: avg=100.88ms med=37.3ms   p(95)=480.96ms p(99)=636.53ms max=676.72ms count=236 
      { name:dashboard }...........: avg=131.93ms med=50.52ms  p(95)=565.86ms p(99)=811.89ms max=1.1s     count=236 
      { name:invoice_pdf }.........: avg=703.54ms med=471.27ms p(95)=2s       p(99)=2.66s    max=2.86s    count=236 
      { name:invoice_send }........: avg=220.09ms med=74.83ms  p(95)=920.43ms p(99)=1.32s    max=1.44s    count=236 
      { name:list_clients }........: avg=71.29ms  med=30.47ms  p(95)=265.01ms p(99)=567.67ms max=772.19ms count=236 
      { name:list_invoices }.......: avg=60.88ms  med=31.79ms  p(95)=205.37ms p(99)=337.85ms max=470.32ms count=236 
      { name:list_quotes }.........: avg=63.64ms  med=36.27ms  p(95)=198.01ms p(99)=422.59ms max=572.75ms count=236 
      { name:login }...............: avg=0s       med=0s       p(95)=0s       p(99)=0s       max=0s       count=0   
      { name:ocr_upload }..........: avg=152.63ms med=113.99ms p(95)=378.06ms p(99)=498.72ms max=533.13ms count=47  
      { name:poll_invoice }........: avg=114.97ms med=49.65ms  p(95)=396.07ms p(99)=521.79ms max=691.59ms count=315 
      { name:poll_ocr }............: avg=56.14ms  med=39.18ms  p(95)=154.16ms p(99)=225.1ms  max=324.48ms count=2309
      { name:quote_convert }.......: avg=102.99ms med=41.8ms   p(95)=445.41ms p(99)=676.51ms max=895.74ms count=236 
      { name:quote_create }........: avg=103.43ms med=45.05ms  p(95)=452.43ms p(99)=672.97ms max=1.05s    count=236 
      { name:session }.............: avg=60.93ms  med=29.51ms  p(95)=253.91ms p(99)=347.03ms max=509.76ms count=236 
    http_req_failed................: 0.00% 0 out of 5031
    http_reqs......................: 5031  14.977467/s

    EXECUTION
    iteration_duration.............: avg=13.48s   med=2.02s    p(95)=1m1s     p(99)=1m2s     max=1m9s     count=236 
    iterations.....................: 236   0.70258/s
    vus............................: 1     min=1         max=10
    vus_max........................: 10    min=10        max=10

    NETWORK
    data_received..................: 27 MB 79 kB/s
    data_sent......................: 11 MB 33 kB/s